IDEA Open Model
ReinfAroundOpening Properties
Compatible with IDEA StatiCa 20.1
The ReinfAroundOpening type exposes the following members.
Properties
Name | Description
AnchorLength
 Anchor length of main bars
Cover
 Cover of reinforcement
 (Inherited from ReinforcementGroup.)
CoverFromSetting
 Use cover from DetailModelSetting
 (Inherited from ReinforcementGroup.)
DiagonalDiameter
 Diameter of diagonal reinforcement
DiagonalDistance
 Distance between diagonal reinforcement layers
DiagonalEndsType
 End type of diagonal reinforcement bar
DiagonalLength
 length of diagonal bar
DiagonalNumOfBarsInLayer
 Number of diagonal bars in layer
DiagonalNumOfLayers
 Number of diagonal layers
DiagonalReinforcement
 Add diagonal reinforcement
Diameter
 Diameter o reinforcement
 (Inherited from ReinforcementGroup.)
DiameterOfMandrel
 Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
 (Inherited from ReinforcementGroup.)
Distance
 Distance between reinforcement layers
EndsTypeBeg
 End type of the beginning of reinforcement bar
 (Inherited from ReinforcementGroup.)
EndsTypeEnd
 End type of the end of reinforcement bar
 (Inherited from ReinforcementGroup.)
Id
 Element Id
 (Inherited from OpenElementId.)
MasterComponent
 Master component of reinforcement
Material
 Material
 (Inherited from Reinforcement.)
NumOfBarsInLayer
 Number of bars in layer
 (Inherited from ReinforcementGroup.)
NumOfLayers
 Number of layers
ReinfId
 Id representing reinforcement in Detail
 (Inherited from Reinforcement.)
Top
See Also
Reference
ReinfAroundOpening Class
IdeaRS.OpenModel.Detail Namespace